tap "edgedb/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "oven-sh/bun"
brew "arp-scan"
brew "bat"
brew "biome"
brew "cocoapods"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "mas"
brew "neofetch"
brew "nmap"
brew "ollama"
brew "postgresql@14"
brew "sqlite"
brew "watchman"
brew "edgedb/tap/edgedb-cli"
brew "jesseduffield/lazygit/lazygit"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "balenaetcher"
cask "discord"
cask "elgato-stream-deck"
cask "font-jetbrains-mono"
cask "git-credential-manager"
cask "iterm2"
cask "pgadmin4"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "stats"
cask "the-unarchiver"
cask "unraid-usb-creator"
cask "warp"
mas "Clean Email", id: 1441250616
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "MKPlayer", id: 1335612105
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhoneCast", id: 1548183660
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "austenc.tailwind-docs"
vscode "biomejs.biome"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "imgildev.vscode-nextjs-generator"
vscode "jacano.vscode-pnpm"
vscode "jeusto.warm-up-typing-test"
vscode "magicstack.edgedb"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "musebe.clerkdocs-snippets"
vscode "nicollasr.vscode-streamdeck"
vscode "oderwat.indent-rainbow"
vscode "oliverdantzer.file-structure-tree"
vscode "pdconsec.vscode-print"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "pranit-harekar.betternaming"
vscode "qwtel.sqlite-viewer"
vscode "reactreedev.reactree"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "supermaven.supermaven"
vscode "timonwong.shellcheck"
vscode "tomrijndorp.find-it-faster"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yomed.theme-dracula-soft"
